webservice-server/build/resources/main/xml/getCardList_new.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:cred="http://www.sc.com/coreBanking/creditCard/v1/ws/provider/creditCardProfile"
                  xmlns:cred1="http://www.sc.com/coreBanking/creditCard/v1/creditCardProfile"
                  xmlns:scb="http://www.sc.com/SCBML-1">
    <soapenv:Body>
        <scb:getCardListing>
            <getCardListingRequest>
                <scb:header>
                    <scb:messageDetails>
                        <scb:messageVersion>1.0</scb:messageVersion>
                        <scb:messageType>
                            <scb:typeName>CardProfile</scb:typeName>
                            <scb:subType>
                                <scb:subTypeName>getCardListing</scb:subTypeName>
                            </scb:subType>
                        </scb:messageType>
                    </scb:messageDetails>
                    <scb:originationDetails>
                        <scb:messageSender>
                            <scb:messageSender>CBT</scb:messageSender>
                            <scb:senderDomain>
                                <scb:domainName>CoreBanking</scb:domainName>
                                <scb:subDomainName>
                                    <scb:subDomainType>CBT</scb:subDomainType>
                                </scb:subDomainName>
                            </scb:senderDomain>
                            <scb:countryCode>TW</scb:countryCode>
                        </scb:messageSender>
                        <scb:messageTimestamp>2024-01-03T07:06:55.304Z</scb:messageTimestamp>
                        <scb:initiatedTimestamp>2024-01-03T07:06:55.304Z</scb:initiatedTimestamp>
                        <scb:trackingId>e536442e-3248-467d-8c55-50fece56d748</scb:trackingId>
                        <scb:possibleDuplicate/>
                    </scb:originationDetails>
                    <scb:captureSystem>CBT</scb:captureSystem>
                    <scb:process>
                        <scb:processName>CardProfile</scb:processName>
                        <scb:eventType>getCardListing</scb:eventType>
                        <scb:lifecycleState/>
                        <scb:workflowState/>
                    </scb:process>
                    <scb:metadata>
                        <scb:tag>
                            <scb:key>targetRegion</scb:key>
                            <scb:value>S1P</scb:value>
                        </scb:tag>
                    </scb:metadata>
                </scb:header>
                <cred1:getCardListingReqPayload>
                    <scb:payloadFormat>XML</scb:payloadFormat>
                    <scb:payloadVersion>1.0</scb:payloadVersion>
                    <cred1:getCardListingReq>
                        <cred1:getCardListingRq>
                            <cred1:AcctSel>
                                <cred1:SCB_EntityType>05</cred1:SCB_EntityType>
                                <cred1:SCB_OrgNum>3</cred1:SCB_OrgNum>
                                <cred1:SCB_CustNum>4509302000000016</cred1:SCB_CustNum>
                            </cred1:AcctSel>
                            <cred1:SCBHdr>
                                <cred1:SCB_EntityType>05</cred1:SCB_EntityType>
                                <cred1:SCB_SourceFlag>CBT</cred1:SCB_SourceFlag>
                            </cred1:SCBHdr>
                        </cred1:getCardListingRq>
                    </cred1:getCardListingReq>
                </cred1:getCardListingReqPayload>
            </getCardListingRequest>
        </scb:getCardListing>
    </soapenv:Body>
</soapenv:Envelope>
